app/controllers/admin_controller.rb

  def index
    @products = Item.all[0..4]
---
SELECT "items".* FROM "items"