app/controllers/fillings_controller.rb

SELECT "fillings".* FROM "fillings"
---
  def index
    @fillings = Filling.all

INSERT INTO "fillings" ("created_at", "description", "food_group", "price", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2014-11-18 21:34:37.927411"], ["description", "Hot and porky"], ["food_group", "Meat"], ["price", 3], ["title", "Carnitas"], ["updated_at", "2014-11-18 21:34:37.927411"]]
---
  def create
    @filling = Filling.new(filling_params)

    if @filling.save

UPDATE "fillings" SET "description" = $1, "food_group" = $2, "title" = $3, "updated_at" = $4 WHERE "fillings"."id" = 29  [["description", "NewDescription"], ["food_group", "NewGroup"], ["title", "NewTitle"], ["updated_at", "2014-11-18 21:34:37.970318"]]
---
  def update
    if @filling.update_attributes(filling_params)

DELETE FROM "fillings" WHERE "fillings"."id" = $1  [["id", 10]]
---
  def destroy
    @filling.destroy

SELECT  "fillings".* FROM "fillings"  WHERE "fillings"."id" = $1 LIMIT 1  [["id", 10]]
---
    def set_filling
      @filling = Filling.find(params[:id])