app/controllers/items_controller.rb

    def create
      @item = Item.new(item_params)

      if @item.save
---
INSERT INTO "items" ("created_at", "description", "food_group", "price", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2014-11-18 12:37:14.671748"], ["description", "Hot and porky"], ["food_group", "Meat"], ["price", 3], ["title", "Carnitas"], ["updated_at", "2014-11-18 12:37:14.671748"]]

    def update
      if @item.update_attributes(item_params)
---
UPDATE "items" SET "description" = $1, "food_group" = $2, "title" = $3, "updated_at" = $4 WHERE "items"."id" = 9  [["description", "NewDescription"], ["food_group", "NewGroup"], ["title", "NewTitle"], ["updated_at", "2014-11-18 12:37:14.724797"]]

    def destroy
      @item.destroy
---
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 14]]

    def menu_items
      @fillings = Filling.all
---
SELECT "fillings".* FROM "fillings"

    def set_item
      @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items"  WHERE "items"."id" = $1 LIMIT 1  [["id", 14]]