app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password_digest", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = 127  [["password_digest", "$2a$04$B7n832u3LuCM9HmmN5Oav.I/RFZUsaUaOa/1f32fPaWVC6.oiw9Vy"], ["updated_at", "2014-11-18 21:53:37.332704"]]

  def destroy
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 173]]

  def set_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 173]]